# mysql과 python 연동
1. 라이브러리 설치
2. sql 서버의 정보를 등록
3. sql 서버에 접속
4. sql 쿼리문을 이용하여 데이터를 CRUD작업

In [2]:
# pymysql 설치
# pip install pymysql

In [3]:
import pymysql

In [4]:
# Sql 서버의 종류 입력
_db =pymysql.connect(
    user ="root",
    password='1234',
    host='localhost',
    db='ubion7',
    port=3306

)

In [5]:
# cursor 변수 생성
# sql 퀴리문을 실행 시키기 위한 필수 변수
# Dictcursor는 sql 쿼리문이 실행되고 나온 데이터를 딕셔너리 형태로 받는다.

cursor= _db.cursor(pymysql.cursors.DictCursor)

In [15]:
sql= """
    select
    *
    from
    user_info
"""

cursor.execute(sql)

4

In [16]:
result=cursor.fetchall()

In [8]:
import pandas as pd

In [17]:
pd.DataFrame(result)

  user_id user_pass user_name   user_phone  user_gender
0    test      1234      test  01012345678            1
1   test2      1234     test2  01011111111            2
2   test3      1234     test3  01099999999            1
3   test4      1111     test4  01011111111            1

In [19]:
sql="""
    select
    *
    from
    example
"""

cursor.execute(sql)
result=cursor.fetchall()
df=pd.DataFrame(result)
df

  Name  Gender          Phone
0    A    male  010-1234-5678
1    B  female  010-1234-5679
2    C    male  010-1234-5680
3    D  female  010-1234-5681
4    E    male  010-1234-5682
5    F  female  010-1234-5683
6    G    male  010-1234-5684
7    H  female  010-1234-5685
8    I    male  010-1234-5686
9    J  female  010-1234-5687

In [25]:
sql="""
    insert into
    user_info
    values
    ("test6","1274","test6","01011119999",1)
"""

cursor.execute(sql)      #깃허브 commit

1

In [27]:
_db.commit()             #깃허브 push

### sql 함수화
1. 첫 번째 함수
    - 매개변수 1개(sql 쿼리문)
    - sql  쿼리문을 실행하고 결과를 데이터프레임으로 변경하여 return
2. 두 번째 함수
    - 매개변수 1개(sql 쿼리문)
    - sql 쿼리문을 실행하고 데이터베이스를 변경
3. 세 번째 함수
    - 1번 함수와 2번 함수를 하나의 함수에서 실행이 될 수 있다고록 생성

In [29]:
def _first(x):
    _db =pymysql.connect(
    user ="root",
    password='1234',
    host='localhost',
    db='ubion7',
    port=3306

)
    cursor= _db.cursor(pymysql.cursors.DictCursor)
    
    cursor.execute(x)
    result=cursor.fetchall()
    df=pd.DataFrame(result)
    return df

In [34]:
def _second(x):
    _db =pymysql.connect(
    user ="root",
    password='1234',
    host='localhost',
    db='ubion7',
    port=3306
)
    cursor= _db.cursor(pymysql.cursors.DictCursor)
    cursor.execute(x)
    _db.commit()

In [35]:
_second("""
    insert into
    user_info
    values
    ("test7","1274","test6","01011119999",1)
""")